{
    "home": "Home",
    "login": "Login",
    "projects": "Projects",
    "tools": "Tools",
    "experience": "Experience",
    "biography": "Biography",
    "certifications": "Certifications",
    "logout": "Logout",
    "customize": "Customize",
    "change language": "Change language",
    "english": "English",
    "spanish": "Spanish",
    "explorer search": "Search in Home",
    "internal-projects": "Internal Projects",
    "close_all_windows": "Close all windows",
    "projects-info": {
        "title": "Projects",
        "introduction": "Throughout my journey, I have worked on projects that allowed me to apply knowledge in technologies such as HTML, CSS, JavaScript, Angular, Spring Boot, and React Native. These experiences range from building dynamic interfaces to developing complete applications with relational databases. Each project has been an opportunity to strengthen my skills and focus on creating functional and high-quality solutions.",
        "projects": {
            "title": "My creations",
            "project1": "CVOrotava Website",
            "project2": "AppAlign",
            "project3": "Portfolio",
            "project4": "Portfolio_v2",
            "project5": "",
            "project6": "",
            "project7": "",
            "project8": "",
            "project9": "",
            "project10": ""
        }
    },
    "experience-info": {
        "title": "Experience",
        "introduction": "I have experience in software development acquired both in academic and professional settings. During my training in the CFGS DAW program, I completed an internship (FCT) at Atos Consulting Canarias from March to May 2023, where I had the opportunity to apply my knowledge in a professional environment. Subsequently, in July 2023, I joined Eviden as a software developer, further enhancing my technical skills and contributing to the development of innovative solutions, thereby strengthening my professional profile in the technology field.",
        "experiences": {
            "experience1": {
                "title": "Internship of the CFGS DAW program",
                "date": "03/2023 - 05/2023",
                "company": "Atos Consulting Canarias",
                "description": "During my training in the CFGS DAW program, I completed an internship (FCT) at Atos Consulting Canarias from March to May 2023, where I worked with technologies and tools such as Spring Boot, Angular, and Bootstrap.",
                "internal-projects": {
                    "project1": {
                        "name": "",
                        "description": ""
                    }
                }
            },
            "experience2": {
                "title": "Software Developer",
                "date": "07/2023 - Present",
                "company": "Eviden",
                "description": "After completing my internship in July 2023, I joined Eviden, where I have continued my training within the company. During this time, I have participated in a project with Orange, specifically collaborating on customer order management. This experience has allowed me to strengthen my technical skills and actively contribute to the development of solutions aimed at optimizing business processes.",
                "internal-projects": {
                    "project1": {
                        "name": "Orange's management system",
                        "description": "Development of the company's management system to process customer orders, including the creation and integration of new functionalities, performance optimization, and the addition of features aligned with business requirements. Tasks also involved designing and developing SQL scripts to populate databases in various non-production environments, integrating new company products into the system, and resolving application-related incidents."
                    }
                }
            }
        }
    },
    "tools-info": {
        "title": "Tools",
        "introduction": "In this section, you'll find a curated collection of tools that can make your work as a software developer more efficient and effective. From productivity boosters to specialized technical solutions, these tools are designed to simplify complex tasks, optimize workflows, and inspire creativity in your projects. I hope you find them as valuable as I do!",
        "tools": {
            "title": "Useful tools for software development",
            "tool1": "Resend",
            "tool2": "Hamburguers",
            "tool3": "Logo Diffusion",
            "tool4": "Omatsuri",
            "tool5": "OverAPI",
            "tool6": "ZealDocs",
            "tool7": "",
            "tool8": "",
            "tool9": "",
            "tool10": ""
        }
    },
    "biography-info": {
        "title": "About me",
        "introduction": "I currently work at Eviden, participating in projects for the company Orange through an internal management application. Although this is my first professional experience, I have contributed to the development of new features, investigated and resolved issues, and managed the insertion of products into the database. To achieve this, I have utilized TIBCO tools in development, which has allowed me to acquire valuable technical skills. Despite my limited experience, I am deeply motivated to continue learning and take on new challenges to grow professionally.",
        "skills": {
            "title": "Skills",
            "hardskills": {
                "title": "Hardskills",
                "skill1": "HTML",
                "skill2": "Spring Boot",
                "skill3": "Tailwind",
                "skill4": "UiPath",
                "skill5": "MySQL",
                "skill6": "AngularJS",
                "skill7": "Metodologías Agiles",
                "skill8": "TIBCO"
            },
            "softskills": {
                "title": "Softskills",
                "skill1": "Creativity",
                "skill2": "Optimistic",
                "skill3": "Hardworking",
                "skill4": "Teamwork",
                "skill5": "Perseverant"
            }
        } 
    }
}