{
    "home": "Inicio",
    "login": "Iniciar sesión",
    "projects": "Proyectos",
    "tools": "Herramientas",
    "experience": "Experiencia",
    "biography": "Biografía",
    "certifications": "Certificados",
    "logout": "Cerrar sesión",
    "customize": "Personalizar",
    "change language": "Cambiar idioma",
    "english": "Inglés",
    "spanish": "Español",
    "explorer search": "Buscar en Inicio",
    "internal-projects": "Proyectos Internos",
    "close_all_windows": "Cerrar todas las ventanas",
    "projects-info": {
        "title": "Proyectos",
        "introduction": "A lo largo de mi trayectoria, he desarrollado proyectos que me han permitido aplicar conocimientos en tecnologías como HTML, CSS, JavaScript, Angular, Spring Boot y React Native. Estas experiencias incluyen desde la creación de interfaces dinámicas hasta el desarrollo de aplicaciones completas con bases de datos relacionales. Cada proyecto ha sido una oportunidad para fortalecer mis habilidades y mi enfoque en crear soluciones funcionales y de calidad.",
        "projects": {
            "title": "Mis creaciones",
            "project1": "CVOrotava Website",
            "project2": "AppAlign",
            "project3": "Portfolio",
            "project4": "Portfolio_v2",
            "project5": "",
            "project6": "",
            "project7": "",
            "project8": "",
            "project9": "",
            "project10": ""
        }
    },
    "experience-info": {
        "title": "Experiencia",
        "introduction": "Poseo experiencia en desarrollo de software adquirida tanto en el ámbito académico como profesional. Durante mi formación en el CFGS DAW, realicé las prácticas de Formación en Centros de Trabajo (FCT) en Atos Consulting Canarias entre marzo y mayo de 2023, donde tuve la oportunidad de aplicar mis conocimientos en el entorno laboral. Posteriormente, en julio de 2023, me incorporé a Eviden como desarrollador de software, fortaleciendo mis habilidades técnicas y participando en el desarrollo de soluciones innovadoras, consolidando así mi perfil profesional en el ámbito tecnológico.",
        "experiences": {
            "experience1": {
                "title": "FCT del CFGS DAW",
                "date": "03/2023 - 05/2023",
                "company": "Atos Consulting Canarias",
                "description": "Durante mi formación en el CFGS DAW, realicé las prácticas de Formación en Centros de Trabajo (FCT) en Atos Consulting Canarias entre marzo y mayo de 2023, viendo como tecnologías y herramientas SpringBoot, Angular y Bootstrap.",
                "internal-projects": {
                    "project1": {
                        "name": "",
                        "description": ""
                    }
                }
            },
            "experience2": {
                "title": "Desarrollador de Software",
                "date": "07/2023 - Actualidad",
                "company": "Eviden",
                "description": "Al finalizar mis prácticas en julio de 2023, me incorporé a Eviden, donde he continuado mi formación dentro de la empresa. Durante este tiempo, he participado en un proyecto con Orange, colaborando específicamente en la gestión de órdenes de clientes. Esta experiencia me ha permitido consolidar mis conocimientos técnicos y contribuir activamente al desarrollo de soluciones orientadas a optimizar los procesos de negocio.",
                "internal-projects": {
                    "project1": {
                        "name": "Sistema de gestión para Orange",
                        "description": "Desarrollo del sistema de gestión de la empresa para poder procesar las órdenes de los clientes, realizando desarrollos e integraciones de nuevas funcionalidades, optimizando el rendimiento y añadiendo nuevas características alineadas con los requisitos del negocio, diseño y desarrollo de scripts SQL para poblar bases de datos en distintos entornos no productivos, integrando nuevos productos de la empresa en el sistema y resolviendo incidencias relacionadas con la aplicación."
                    }
                }
            }
        }
    },
    "tools-info": {
        "title": "Herramientas",
        "introduction": "En esta sección encontrarás una colección de herramientas cuidadosamente seleccionadas que pueden facilitar y potenciar tu trabajo como desarrollador de software. Desde utilidades para mejorar la productividad hasta soluciones técnicas específicas, estas herramientas están diseñadas para simplificar tareas complejas, optimizar flujos de trabajo y fomentar la creatividad en tus proyectos. ¡Espero que te resulten tan útiles como a mí!",
        "tools": {
            "title": "Herramientas útiles para el desarrollo de software",
            "tool1": "Resend",
            "tool2": "Hamburguers",
            "tool3": "Logo Diffusion",
            "tool4": "Omatsuri",
            "tool5": "OverAPI",
            "tool6": "ZealDocs",
            "tool7": "",
            "tool8": "",
            "tool9": "",
            "tool10": ""
        }
    },
    "biography-info": {
        "title": "Acerca de mí",
        "introduction": "Actualmente trabajo en Eviden, participando en proyectos para la empresa Orange mediante una aplicación de gestión interna. Aunque esta es mi primera experiencia laboral, he contribuido al desarrollo de nuevas funcionalidades, investigado y resuelto incidencias, y gestionado la inserción de productos en la base de datos. Para ello, he utilizado herramientas de TIBCO en el desarrollo, lo que me ha permitido adquirir habilidades técnicas valiosas. A pesar de que mi experiencia es limitada, me motiva profundamente seguir aprendiendo y enfrentar nuevos desafíos para crecer profesionalmente.",
        "skills": {
            "title": "Habilidades",
            "hardskills": {
                "title": "Hardskills",
                "skill1": "HTML",
                "skill2": "Spring Boot",
                "skill3": "Tailwind",
                "skill4": "UiPath",
                "skill5": "MySQL",
                "skill6": "AngularJS",
                "skill7": "Metodologías Agiles",
                "skill8": "TIBCO"
            },
            "softskills": {
                "title": "Softskills",
                "skill1": "Creatividad",
                "skill2": "Optimista",
                "skill3": "Trabajador",
                "skill4": "Trabajo en equipo",
                "skill5": "Perseverante"
            }
        } 
    }
}